{
  "education": [
    {
      "awards_achievements": [
        "Minor in Psychology",
        "Dean's List (2020, 2021)"
      ],
      "degree": "Bachelor of Computing",
      "department": "College of Engineering \u0026 Physical Sciences",
      "duration": "2019-2023",
      "school_name": "University of Guelph"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TanyaNantsa",
  "highlighted_projects": [
    {
      "description": "A platform where I share coding and sewing projects I work on, my personal interests, and additional contact information. Website is hosted using GitHub pages. The technologies used are HTML, CSS, and JavaScript.",
      "git_url": "https://github.com/tanya-nantsa/tanya-nantsa.github.io",
      "name": "Personal Website"
    },
    {
      "description": "A terminal game where the user selects whether they wish to play the one-player or two-player version of the game. For the one player version, I implemented a basic chess AI which uses a min-max tree with A-B pruning for determining the computer's best moves. Made with Python.",
      "git_url": "https://github.com/tanya-nantsa/ChessGame",
      "name": "Chess Game"
    },
    {
      "description": "An application where users can edit and manipulate images. This toolbox allows users to crop, scale, flip, rotate, apply zero padding, change the brightness, change the contrast, apply filters, and detect edges in their images. The edited image is saved to the user's computer. Made with Python.",
      "git_url": "https://github.com/tanya-nantsa/ImageProcessingToolbox",
      "name": "Image Processing Toolbox"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux cluster monitoring project is resolves the Jarvis Linux Cluster Administration (LCA) team?s need to manage a Linux cluster of 10 servers running CentOS 7. The project collects and stores real-time hardware specifications and resource usage data for each server into a database, enabling the LCA team to generate reports and use data analytics to make informed decisions about server additions or removals. The technologies used include Docker for the containerized deployment of the PostgreSQL database instance, Bash scripts for the data parsing and data collection on individual servers, PostgreSQL for the database, crontab for automating the bash script that collects resource usage data, and Git for version control and feature management within the project.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "The Grep Java application behaves similarly to the Linux grep command, identifying string patterns within files and returning lines containing the matching pattern. The application, implemented with Java 8, utilized Maven for building the java project (including compiling code and packaging artifacts), managing dependencies, enforcing a consistent project structure, and cleaning the package artifacts in the project. IntelliJ IDE facilitated code editing, running, and debugging. Lambda and Stream API enhanced the application, integrating lazy evaluations and concise code for increased readability. Finally, Docker was employed to build a Docker image for the app and then push the image to Docker Hub.",
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Tanya Nantsa",
  "others": [
    {
      "bullets": [
        "Maintains a blog to share personal sewing projects",
        "Crochets and knits clothes and blankets"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "At Jarvis Consulting Group I gained hands-on experience with a diverse set of technologies including Linux, SQL, Git, Java, Spring Boot, REST API, Cloud Computing, DevOps, and Data Analytics using SQL and Python. Throughout this role, I collaborate with Tech Leads and Professionals, contributing to the development of projects and writing code in Java, Python, SQL, and more. Additionally, I enhanced my time management, problem-solving, and communication skills.",
      "duration": "Jan 2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Scotiabank",
      "description": "Worked on the Behavioural Data Science team to develop a model for verifying customer home addresses and identifying traveling customers using location data. Analyzed fraud rate of traveling customers to identify significant patterns. Solutions developed from this migration analysis project are to be used by other team members on existing projects within the company. The technologies used include SQL, Python, Adobe Analytics.",
      "duration": "May 2022-Aug 2022",
      "title": "Data Analyst Intern"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "JavaScript",
      "Firebase",
      "Linux/Bash",
      "C"
    ],
    "familiar": [
      "React",
      "Bootstrap",
      "Selenium",
      "JUnit",
      "Ruby"
    ],
    "proficient": [
      "Python",
      "Java",
      "HTML",
      "CSS",
      "SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I recently graduated with a Bachelor's in Software Engineering from the University of Guelph. As a Data Analyst Intern at Scotiabank, I honed my Python, SQL, and data analysis skills. With a minor in Psychology, I bring a unique perspective to understanding user behaviour. I am passionate about problem-solving, creating a positive impact, and continuously improving my skills in Software Development. Seeking a role as a Software Developer, I bring a strong foundation in Python, Java, HTML, and SQL. Also, my strong communication, time management, and teamwork skills make me a great team addition. My attentive nature, adaptability, and passion for problem-solving make me an ideal candidate for contributing to dynamic and collaborative development teams."
}
